##############################################################################
# FFMPEG CHEATSHEET (中文速查表)  -  by skywind (created on 2020/09/20)
# Version: 3, Last Modified: 2020/09/21 14:37
# https://github.com/skywind3000/awesome-cheatsheets
##############################################################################


##############################################################################
# 基礎參數
##############################################################################

-codecs                                                     # 列出可用編碼
-formats                                                    # 列出支持的格式
-protocols                                                  # 列出支持的協議
-i input.mp4                                                # 指定輸入文件
-c:v libx264                                                # 指定視頻編碼
-c:a aac                                                    # 指定音頻編碼
-vcodec libx264                                             # 舊寫法
-acodec aac                                                 # 舊寫法
-fs SIZE                                                    # 指定文件大小


##############################################################################
# 音頻參數
##############################################################################

-aq QUALITY                                                 # 音頻質量，編碼器相關
-ar 44100                                                   # 音頻採樣率
-ac 1                                                       # 音頻聲道數量
-an                                                         # 禁止音頻
-vol 512                                                    # 改變音量為 200%


##############################################################################
# 視頻參數
##############################################################################

-aspect RATIO                                               # 長寬比 4:3, 16:9
-r RATE                                                     # 每秒幀率
-s WIDTHxHEIGHT                                             # 視頻尺寸：640x480
-vn                                                         # 禁用視頻


##############################################################################
# 碼率設置
##############################################################################

-b:v 1M                                                     # 設置視頻碼率 1mbps/s
-b:a 1M                                                     # 設置音頻碼率 1mbps/s


##############################################################################
# 視頻轉碼
##############################################################################

ffmpeg -i input.mov output.mp4                              # 轉碼為 MP4
ffmpeg -i input.mp4 -vn -c:a copy output.aac                # 提取音頻
ffmpeg -i input.mp4 -vn -c:a mp3 output.mp3                 # 提取音頻並轉碼
ffmpeg -i input.mov -c:v libx264 -c:a aac -2 out.mp4        # 指定編碼參數
ffmpeg -i input.mov -c:v libvpx -c:a libvorbis out.webm     # 轉換 webm
ffmpeg -i input.mp4 -ab 56 -ar 44100 -b 200 -f flv out.flv  # 轉換 flv
ffmpeg -i input.mp4 -an animated.gif                        # 轉換 GIF


##############################################################################
# 切分視頻
##############################################################################

ffmpeg -i input.mp4 -ss 0 -t 60 first-1-min.mp4             # 切割開頭一分鐘
ffmpeg -i input.mp4 -ss 60 -t 60 second-1-min.mp4           # 一分鐘到兩分鐘
ffmpeg -i input.mp4 -ss 00:01:23.000 -t 60 first-1-min.mp4  # 另一種時間格式


##############################################################################
# 視頻尺寸
##############################################################################

ffmpeg -i input.mp4 -vf "scale=640:320" output.mp4          # 視頻尺寸縮放
ffmpeg -i input.mp4 -vf "crop=400:300:10:10" output.mp4     # 視頻尺寸裁剪


##############################################################################
# 其他用法
##############################################################################

ffmpeg -i sub.srt sub.ass                                   # 字幕格式轉換
ffmpeg -i input.mp4 -vf ass=sub.ass out.mp4                 # 燒錄字幕進視頻
ffmpeg -i "<url>" out.mp4                                   # 下載視頻


##############################################################################
# 組合用法
##############################################################################

# 給 gif 加上靜音音軌並轉換成 mp4
ffmpeg -f lavfi -i anullsrc -i in.gif -c:v libx264 -c:a aac -shortest out.mp4

# 給 gif 加上靜音音軌並轉換成 mp4，兼容手機播放
ffmpeg -f lavfi -i anullsrc -i in.gif -c:v libx264 -c:a aac -shortest \
       -pix_fmt yuv420p -vf "scale=trunc(iw/2)*2:trunc(ih/2)*2" out.mp4


##############################################################################
# 相關資源
##############################################################################

https://cheatography.com/thetartankilt/cheat-sheets/ffmpeg/
http://qwinff.github.io/



